WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetDecimal_Client_Request-14.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetDecimal</a:Action>
    <a:MessageID>urn:uuid:c946380e-0c0a-4f02-b0f8-2271f60698ee</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDecimal xmlns="http://tempuri.org/">
      <inDecimal>100000.00</inDecimal>
    </RetDecimal>
  </s:Body>
</s:Envelope>